
* API endpoints
** Return object
#+BEGIN_SRC code
{
  "error": true || false,
  "code": HTTP codes as number,
  "message": String or null,
  "data": Object or array
}
#+END_SRC

** /api/scoreboard/

Append to or from for different scoreboard

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/scoreboard/from/dec
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": "ok",
  "data": [
    {
      "username": "USER4",
      "name": "User4",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 2027
    },
    {
      "username": "USER2",
      "name": "User2",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 2019
    },
    {
      "username": "USER3",
      "name": "User3",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 1997
    },
    {
      "username": "USER1",
      "name": "User1",
      "avatar": "https://link.to.avatar.48.burrito",
      "score": 1958
    }
  ]
}
#+end_example

** /api/userstats/

Append username of the user you want to get more stats from

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/userstats/USER2
#+END_SRC

#+RESULTS:
#+begin_example
{
  "error": false,
  "code": 200,
  "message": "ok",
  "data": {
    "user": {
      "username": "USER2",
      "name": "User2",
      "avatar": "https://link.to.avatar.48.burrito",
      "receivedToday": 3840,
      "givenToday": 3712,
      "received": 3840,
      "given": 3712
    },
    "given": [
      {
        "username": "USER1",
        "name": "User1",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 626,
        "scoredec": 627
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 593,
        "scoredec": 639
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 608,
        "scoredec": 619
      }
    ],
    "received": [
      {
        "username": "USER1",
        "name": "User1",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 653,
        "scoredec": 595
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 661,
        "scoredec": 638
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 625,
        "scoredec": 668
      }
    ],
    "givenToday": [
      {
        "username": "USER1",
        "name": "User1",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 626,
        "scoredec": 627
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 593,
        "scoredec": 639
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 608,
        "scoredec": 619
      }
    ],
    "receivedToday": [
      {
        "username": "USER1",
        "name": "User1",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 653,
        "scoredec": 595
      },
      {
        "username": "USER3",
        "name": "User3",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 661,
        "scoredec": 638
      },
      {
        "username": "USER4",
        "name": "User4",
        "avatar": "https://link.to.avatar.48.burrito",
        "scoreinc": 625,
        "scoredec": 668
      }
    ]
  }
}
#+end_example
** /api/userstats/today/
Append username of the user you want to get more stats from

#+BEGIN_SRC http :pretty
GET http://heyburrito:3333/api/userstats/today/UEKN9GNAJ
#+END_SRC

#+RESULTS:
: {
:   "error": false,
:   "code": 200,
:   "message": "ok",
:   "data": {
:     "givenToday": 0,
:     "receivedToday": 0
:   }
: }

** /api/histogram/ PRE-ALPHA

Be able to search with filters

Should be able to take folling params
| params                 | type   | required |
|------------------------+--------+----------|
| username               | string | no       |
| startDate              | string | no       |
| endDate                | string | no       |
| type ( given / gived ) | string | no       |

#+BEGIN_SRC http :pretty
POST http://heyburrito:3333/api/histogram
Content-Type: application/json


#+END_SRC

#+RESULTS:
: {
:   "error": false,
:   "code": 200,
:   "message": null,
:   "data": null
: }
